In [1]:
#import pandas
import pandas as pd

In [2]:
#########################
#Preliminary Exploration#
#########################

In [3]:
#prepare paths to import data
msa_csv = "data/msa_data.csv"
national_csv = "data/national_data.csv"
skill_csv = "data/skill_data.csv"
posting_csv = "data/job_postings.csv"

In [4]:
#read msa_data as df and check
msa_df = pd.read_csv(msa_csv, sep=",")
msa_df.head()

,MSA_ID,Metro Area,OCC_CODE,Job Group,Total Employment,Jobs per 1000,Location Quotient,Mean Annual Wage,Annual Wage 10th Pct,Annual Wage 25th Pct,Median Annual Wage,Annual Wage 75th Pct,Annual Wage 90th Pct
0,10180,"Abilene, TX",11-1021,General and Operations Managers,1100.0,16.499,1.01,84000.0,22810.0,50350.0,73850.0,106870.0,154520.0
1,10180,"Abilene, TX",11-2022,Sales Managers,110.0,1.728,0.63,124710.0,47360.0,72140.0,119920.0,155050.0,207570.0
2,10180,"Abilene, TX",11-2030,Public Relations and Fundraising Managers,40.0,0.571,1.06,NaN,NaN,NaN,NaN,NaN,NaN
3,10180,"Abilene, TX",11-3010,Administrative Services and Facilities Managers,150.0,2.197,1.05,84350.0,52360.0,58760.0,71810.0,91380.0,120490.0
4,10180,"Abilene, TX",11-3021,Computer and Information Systems Managers,50.0,0.819,0.28,116390.0,56260.0,74910.0,104350.0,144370.0,194760.0

In [5]:
#check msa_df datatypes
msa_df.dtypes

MSA_ID                    int64
Metro Area               object
OCC_CODE                 object
Job Group                object
Total Employment        float64
Jobs per 1000           float64
Location Quotient       float64
Mean Annual Wage        float64
Annual Wage 10th Pct    float64
Annual Wage 25th Pct    float64
Median Annual Wage      float64
Annual Wage 75th Pct    float64
Annual Wage 90th Pct    float64
dtype: object

In [6]:
#check NaNs
msa_df.isnull().sum().sort_values(ascending = False)

Location Quotient       11651
Jobs per 1000           11651
Total Employment        11651
Annual Wage 90th Pct     6458
Annual Wage 75th Pct     4361
Median Annual Wage       3508
Annual Wage 25th Pct     2918
Annual Wage 10th Pct     2692
Mean Annual Wage         2688
Job Group                   0
OCC_CODE                    0
Metro Area                  0
MSA_ID                      0
dtype: int64

In [7]:
#calculate percentage of NaN
msa_length = msa_df["OCC_CODE"].count()
msa_NaN = msa_df["Total Employment"].isnull().sum()
print(f"NaN values are {msa_NaN/msa_length*100}")

NaN values are 8.735913143234185

In [8]:
#read national_data as df and check
national_df = pd.read_csv(national_csv, sep=",")
national_df.head()

,BLS Job Title,LONG_OCC_CODE,Percentage with AA Degree or Less,Percentage with BA Degree or More,Total Employment (National),Mean Annual Wage (National),Annual Wage 10th Pct (National),Annual Wage 25th Pct (National),Median Annual Wage (National),Annual Wage 75th Pct (National),Annual Wage 90th Pct (National),Typical education needed for entry,Work experience in a related occupation,Non-Entry Level,BA Entry Level,Middle Skilled,Low Wage
0,Computer Operator,43-9011.00,64.9,35.1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,High school diploma or equivalent,None,False,False,True,False
1,Business Intelligence Analyst,15-1199.93,43.8,56.4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Bachelor's degree,None,False,True,False,False
2,IT Project Manager,15-1199.95,43.8,56.4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Bachelor's degree,None,False,True,False,False
3,Network Engineer / Architect,15-1199.02,43.8,56.4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Bachelor's degree,None,False,True,False,False
4,Network Engineer / Architect,15-1133.00,14.7,85.2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Bachelor's degree,None,False,True,False,False

In [9]:
#check national_df datatypes
national_df.dtypes

BLS Job Title                               object
LONG_OCC_CODE                               object
Percentage with AA Degree or Less          float64
Percentage with BA Degree or More          float64
Total Employment (National)                float64
Mean Annual Wage (National)                float64
Annual Wage 10th Pct (National)            float64
Annual Wage 25th Pct (National)            float64
Median Annual Wage (National)              float64
Annual Wage 75th Pct (National)            float64
Annual Wage 90th Pct (National)            float64
Typical education needed for entry          object
Work experience in a related occupation     object
Non-Entry Level                               bool
BA Entry Level                                bool
Middle Skilled                                bool
Low Wage                                      bool
dtype: object

In [10]:
#check NaNs
national_df.isnull().sum().sort_values(ascending = False)

Annual Wage 90th Pct (National)            232
Annual Wage 75th Pct (National)            166
Median Annual Wage (National)              165
Annual Wage 25th Pct (National)            165
Annual Wage 10th Pct (National)            165
Mean Annual Wage (National)                165
Total Employment (National)                164
Percentage with AA Degree or Less            6
Work experience in a related occupation      6
Typical education needed for entry           6
Percentage with BA Degree or More            6
LONG_OCC_CODE                                0
Low Wage                                     0
Middle Skilled                               0
Non-Entry Level                              0
BA Entry Level                               0
BLS Job Title                                0
dtype: int64

In [11]:
#calculate percentage of NaN
national_length = national_df["LONG_OCC_CODE"].count()
national_NaN = national_df["Annual Wage 90th Pct (National)"].isnull().sum()
print(f"NaN values are {national_NaN/national_length*100}")

NaN values are 40.98939929328622

In [12]:
#read skill_data as df and check
skill_df = pd.read_csv(skill_csv, sep=",")
skill_df.head()

,LONG_OCC_CODE,BLS Job Title,Artistic_oi,Conventional_oi,Enterprising_oi,Investigative_oi,Realistic_oi,Social_oi,Arm-Hand Steadiness_im,Auditory Attention_im,...,Persistence_im,Self Control_im,Social Orientation_im,Stress Tolerance_im,Achievement_ex,Independence_ex,Recognition_ex,Relationships_ex,Support_ex,Working Conditions_ex
0,11-1011.00,Chief Executives,2.67,5.33,7.0,2.00,1.33,3.67,1.00,2.12,...,4.43,4.52,3.67,4.75,6.33,7.00,7.00,5.00,5.33,6.33
1,11-1011.03,Chief Sustainability Officers,2.67,4.33,7.0,4.33,1.00,2.33,1.00,1.88,...,4.31,4.00,3.35,4.08,6.67,6.67,6.00,5.00,3.33,6.33
2,11-1021.00,General and Operations Managers,1.00,3.67,7.0,1.33,1.33,3.33,2.00,2.12,...,4.04,4.31,3.57,4.33,5.33,6.00,5.67,6.33,4.67,6.00
3,11-1031.00,Legislators,3.67,3.00,7.0,3.67,1.00,4.67,NaN,NaN,...,NaN,NaN,NaN,NaN,5.33,5.00,5.00,5.67,4.00,4.33
4,11-2011.00,Advertising and Promotions Managers,5.33,4.67,7.0,2.00,1.67,2.33,1.38,1.75,...,4.32,4.18,3.70,4.35,5.33,5.33,5.33,5.00,4.00,5.33

In [13]:
#check skill_df datatypes
skill_df.dtypes

LONG_OCC_CODE             object
BLS Job Title             object
Artistic_oi              float64
Conventional_oi          float64
Enterprising_oi          float64
                          ...
Independence_ex          float64
Recognition_ex           float64
Relationships_ex         float64
Support_ex               float64
Working Conditions_ex    float64
Length: 352, dtype: object

In [14]:
#check NaNs
skill_df.isnull().sum().sort_values(ascending = False)

Attention to Detail_im         7
Integrity_im                   7
Achievement/Effort_im          7
Adaptability/Flexibility_im    7
Analytical Thinking_im         7
                              ..
Achievement_ex                 0
Independence_ex                0
Recognition_ex                 0
Relationships_ex               0
LONG_OCC_CODE                  0
Length: 352, dtype: int64

In [15]:
#calculate percentage of NaN
skill_length = skill_df["LONG_OCC_CODE"].count()
skill_NaN = skill_df["Concern for Others_im"].isnull().sum()
print(f"NaN values are {skill_NaN/skill_length*100}")

NaN values are 0.7186858316221766

In [16]:
#read job_posting as df and check
posting_df = pd.read_csv(posting_csv, sep=",")
posting_df.head()

,JOB_ID,BLS Job Title,LONG_OCC_CODE,YEAR,STATE,CITY,MSA_ID,CANON_MAXIMUM_DEGREE,CANON_MINIMUM_DEGREE,CANON_OTHER_DEGREES,...,CIP_CODE,STANDARD_MAJOR,MAX_EXPERIENCE,MIN_EXPERIENCE,MAX_ANNUAL_SALARY,MAX_HOURLY_SALARY,MIN_ANNUAL_SALARY,MIN_HOURLY_SALARY,YEARS_OF_EXPERIENCE,CANON_JOB_HOURS
0,38472841335,Recruiter (General),13-1071.91,2019,WA,Seattle,42660.0,Bachelor's,Higher Secondary Certificate,NaN,...,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,2+ years|2 years,fulltime
1,38474073426,Estimator,13-1051.00,2019,AZ,Chandler,38060.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,38474083740,Auto Body Technician,49-3021.00,2019,AZ,Chandler,38060.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,38709992297,General Manager,11-1021.92,2020,FL,Tampa,45300.0,Bachelor's,Higher Secondary Certificate,NaN,...,NaN,NaN,5.0,3.0,NaN,NaN,NaN,NaN,3-5 years,NaN
4,38709918452,Maintenance Helper / Assistant,49-9098.00,2020,TX,San Antonio,41700.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
#check posting_df datatypes
posting_df.dtypes

JOB_ID                       int64
BLS Job Title               object
LONG_OCC_CODE               object
YEAR                         int64
STATE                       object
CITY                        object
MSA_ID                     float64
CANON_MAXIMUM_DEGREE        object
CANON_MINIMUM_DEGREE        object
CANON_OTHER_DEGREES        float64
CANON_PREFERRED_DEGREES     object
CANON_REQUIRED_DEGREES      object
CIP_CODE                    object
STANDARD_MAJOR              object
MAX_EXPERIENCE             float64
MIN_EXPERIENCE             float64
MAX_ANNUAL_SALARY          float64
MAX_HOURLY_SALARY          float64
MIN_ANNUAL_SALARY          float64
MIN_HOURLY_SALARY          float64
YEARS_OF_EXPERIENCE         object
CANON_JOB_HOURS             object
dtype: object

In [18]:
#check NaNs
posting_df.isnull().sum().sort_values(ascending = False)

CANON_OTHER_DEGREES        5079
STANDARD_MAJOR             5042
CIP_CODE                   5042
MAX_EXPERIENCE             4926
CANON_PREFERRED_DEGREES    4905
CANON_MAXIMUM_DEGREE       4895
MIN_EXPERIENCE             4662
CANON_REQUIRED_DEGREES     4600
CANON_MINIMUM_DEGREE       4565
YEARS_OF_EXPERIENCE        4146
CANON_JOB_HOURS            4057
MAX_ANNUAL_SALARY          3163
MAX_HOURLY_SALARY          3163
MIN_ANNUAL_SALARY          3163
MIN_HOURLY_SALARY          3163
MSA_ID                       24
CITY                         23
STATE                         0
YEAR                          0
LONG_OCC_CODE                 0
BLS Job Title                 0
JOB_ID                        0
dtype: int64

In [19]:
#calculate percentage of NaN
posting_length = posting_df["LONG_OCC_CODE"].count()
posting_NaN = posting_df["CANON_OTHER_DEGREES"].isnull().sum()
print(f"NaN values are {posting_NaN/posting_length*100}")

NaN values are 100.0

In [20]:
#verify that 5079 is 100% the size of the DF
print(f"Length: {posting_length}. NaN Count: {posting_NaN}.")

Length: 5079. NaN Count: 5079.

In [21]:
######################
#Clean individual DFs#
######################

In [22]:
#Drop NaNs from msa_df, and print difference from old df
msa_df = msa_df.dropna()
print(msa_length-msa_df["OCC_CODE"].count())

17634

In [23]:
#compare greatest NaN row to rows dropped
print(msa_NaN)

11651

In [24]:
#Print new msa_df
msa_df.head()

,MSA_ID,Metro Area,OCC_CODE,Job Group,Total Employment,Jobs per 1000,Location Quotient,Mean Annual Wage,Annual Wage 10th Pct,Annual Wage 25th Pct,Median Annual Wage,Annual Wage 75th Pct,Annual Wage 90th Pct
0,10180,"Abilene, TX",11-1021,General and Operations Managers,1100.0,16.499,1.01,84000.0,22810.0,50350.0,73850.0,106870.0,154520.0
1,10180,"Abilene, TX",11-2022,Sales Managers,110.0,1.728,0.63,124710.0,47360.0,72140.0,119920.0,155050.0,207570.0
3,10180,"Abilene, TX",11-3010,Administrative Services and Facilities Managers,150.0,2.197,1.05,84350.0,52360.0,58760.0,71810.0,91380.0,120490.0
4,10180,"Abilene, TX",11-3021,Computer and Information Systems Managers,50.0,0.819,0.28,116390.0,56260.0,74910.0,104350.0,144370.0,194760.0
6,10180,"Abilene, TX",11-3051,Industrial Production Managers,40.0,0.603,0.48,98640.0,57580.0,68030.0,88490.0,111530.0,130800.0

In [25]:
#wage data does not seem to be of importance, and has a high amount of NaN values. Dropped columns
national_df = national_df.drop(columns=['Annual Wage 90th Pct (National)', 'Annual Wage 75th Pct (National)', 'Annual Wage 25th Pct (National)', 'Annual Wage 10th Pct (National)', 'Median Annual Wage (National)', 'Mean Annual Wage (National)', 'Total Employment (National)'])
national_df.head()

,BLS Job Title,LONG_OCC_CODE,Percentage with AA Degree or Less,Percentage with BA Degree or More,Typical education needed for entry,Work experience in a related occupation,Non-Entry Level,BA Entry Level,Middle Skilled,Low Wage
0,Computer Operator,43-9011.00,64.9,35.1,High school diploma or equivalent,None,False,False,True,False
1,Business Intelligence Analyst,15-1199.93,43.8,56.4,Bachelor's degree,None,False,True,False,False
2,IT Project Manager,15-1199.95,43.8,56.4,Bachelor's degree,None,False,True,False,False
3,Network Engineer / Architect,15-1199.02,43.8,56.4,Bachelor's degree,None,False,True,False,False
4,Network Engineer / Architect,15-1133.00,14.7,85.2,Bachelor's degree,None,False,True,False,False

In [26]:
#The earlier exploration showed a few columns with about 6 NaN values. Dropped, and checked lengths of old and new dfs
national_df = national_df.dropna()
print(national_df["LONG_OCC_CODE"].count())
print(national_length)

560
566

In [27]:
#skill df had minimum NaNs. Dropped NaNs, and verified minimal data loss
skill_df = skill_df.dropna()
print(skill_df["LONG_OCC_CODE"].count())
print(skill_length)

967
974

In [28]:
#Earlier exploration showed it is best to remove certain rows from posting_df
posting_df = posting_df.filter(['MSA_ID', 'CITY', 'STATE', 'YEAR', 'LONG_OCC_CODE', 'BLS Job Title', 'JOB_ID'])
posting_df.head()

,MSA_ID,CITY,STATE,YEAR,LONG_OCC_CODE,BLS Job Title,JOB_ID
0,42660.0,Seattle,WA,2019,13-1071.91,Recruiter (General),38472841335
1,38060.0,Chandler,AZ,2019,13-1051.00,Estimator,38474073426
2,38060.0,Chandler,AZ,2019,49-3021.00,Auto Body Technician,38474083740
3,45300.0,Tampa,FL,2020,11-1021.92,General Manager,38709992297
4,41700.0,San Antonio,TX,2020,49-9098.00,Maintenance Helper / Assistant,38709918452

In [29]:
#######################
#Prepare DFs for Merge#
#######################

In [30]:
#creat OCC_CODE column that drops last 3 chars from LONG_OCC_CODE
national_df['OCC_CODE'] = national_df['LONG_OCC_CODE'].str.slice(stop=7)
national_df = national_df.drop(columns=['LONG_OCC_CODE'])
national_df.head()

,BLS Job Title,Percentage with AA Degree or Less,Percentage with BA Degree or More,Typical education needed for entry,Work experience in a related occupation,Non-Entry Level,BA Entry Level,Middle Skilled,Low Wage,OCC_CODE
0,Computer Operator,64.9,35.1,High school diploma or equivalent,None,False,False,True,False,43-9011
1,Business Intelligence Analyst,43.8,56.4,Bachelor's degree,None,False,True,False,False,15-1199
2,IT Project Manager,43.8,56.4,Bachelor's degree,None,False,True,False,False,15-1199
3,Network Engineer / Architect,43.8,56.4,Bachelor's degree,None,False,True,False,False,15-1199
4,Network Engineer / Architect,14.7,85.2,Bachelor's degree,None,False,True,False,False,15-1133

In [31]:
#creat OCC_CODE column that drops last 3 chars from LONG_OCC_CODE
skill_df['OCC_CODE'] = skill_df['LONG_OCC_CODE'].str.slice(stop=7)
skill_df = skill_df.drop(columns=['LONG_OCC_CODE'])
skill_df.head()

,BLS Job Title,Artistic_oi,Conventional_oi,Enterprising_oi,Investigative_oi,Realistic_oi,Social_oi,Arm-Hand Steadiness_im,Auditory Attention_im,Category Flexibility_im,...,Self Control_im,Social Orientation_im,Stress Tolerance_im,Achievement_ex,Independence_ex,Recognition_ex,Relationships_ex,Support_ex,Working Conditions_ex,OCC_CODE
0,Chief Executives,2.67,5.33,7.0,2.00,1.33,3.67,1.00,2.12,3.50,...,4.52,3.67,4.75,6.33,7.00,7.00,5.00,5.33,6.33,11-1011
1,Chief Sustainability Officers,2.67,4.33,7.0,4.33,1.00,2.33,1.00,1.88,3.38,...,4.00,3.35,4.08,6.67,6.67,6.00,5.00,3.33,6.33,11-1011
2,General and Operations Managers,1.00,3.67,7.0,1.33,1.33,3.33,2.00,2.12,3.00,...,4.31,3.57,4.33,5.33,6.00,5.67,6.33,4.67,6.00,11-1021
4,Advertising and Promotions Managers,5.33,4.67,7.0,2.00,1.67,2.33,1.38,1.75,3.38,...,4.18,3.70,4.35,5.33,5.33,5.33,5.00,4.00,5.33,11-2011
6,Marketing Managers,3.67,5.33,7.0,2.33,1.00,2.67,1.12,1.88,3.25,...,3.87,3.80,4.01,6.00,5.67,5.33,5.67,5.00,6.17,11-2021

In [32]:
#creat OCC_CODE column that drops last 3 chars from LONG_OCC_CODE
posting_df['OCC_CODE'] = posting_df['LONG_OCC_CODE'].str.slice(stop=7)
posting_df = posting_df.drop(columns=['LONG_OCC_CODE'])
posting_df.head()

,MSA_ID,CITY,STATE,YEAR,BLS Job Title,JOB_ID,OCC_CODE
0,42660.0,Seattle,WA,2019,Recruiter (General),38472841335,13-1071
1,38060.0,Chandler,AZ,2019,Estimator,38474073426,13-1051
2,38060.0,Chandler,AZ,2019,Auto Body Technician,38474083740,49-3021
3,45300.0,Tampa,FL,2020,General Manager,38709992297,11-1021
4,41700.0,San Antonio,TX,2020,Maintenance Helper / Assistant,38709918452,49-9098

In [36]:
#Check remaining datatypes before merge
msa_df.dtypes

MSA_ID                    int64
Metro Area               object
OCC_CODE                 object
Job Group                object
Total Employment        float64
Jobs per 1000           float64
Location Quotient       float64
Mean Annual Wage        float64
Annual Wage 10th Pct    float64
Annual Wage 25th Pct    float64
Median Annual Wage      float64
Annual Wage 75th Pct    float64
Annual Wage 90th Pct    float64
dtype: object

In [37]:
national_df.dtypes

BLS Job Title                               object
Percentage with AA Degree or Less          float64
Percentage with BA Degree or More          float64
Typical education needed for entry          object
Work experience in a related occupation     object
Non-Entry Level                               bool
BA Entry Level                                bool
Middle Skilled                                bool
Low Wage                                      bool
OCC_CODE                                    object
dtype: object

In [38]:
skill_df.dtypes

BLS Job Title             object
Artistic_oi              float64
Conventional_oi          float64
Enterprising_oi          float64
Investigative_oi         float64
                          ...
Recognition_ex           float64
Relationships_ex         float64
Support_ex               float64
Working Conditions_ex    float64
OCC_CODE                  object
Length: 352, dtype: object

In [39]:
posting_df.dtypes

MSA_ID           float64
CITY              object
STATE             object
YEAR               int64
BLS Job Title     object
JOB_ID             int64
OCC_CODE          object
dtype: object